#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "PLR-SHOPPERS"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-SHOPPERS.keycloak_openid_hardcoded_claim_protocol_mapper.orgId will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "orgId" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "orgId"
      + claim_value         = "00024727"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "orgId"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-SHOPPERS.keycloak_openid_user_session_note_protocol_mapper.Client-Host will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-Host" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientHost"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client Host"
      + realm_id            = "moh_applications"
      + session_note        = "clientHost"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-SHOPPERS.keycloak_openid_user_session_note_protocol_mapper.Client-ID will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-ID" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientId"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client ID"
      + realm_id            = "moh_applications"
      + session_note        = "clientId"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-SHOPPERS.keycloak_openid_user_session_note_protocol_mapper.Client-IP-Address will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-IP-Address" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientAddress"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client IP Address"
      + realm_id            = "moh_applications"
      + session_note        = "clientAddress"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-SHOPPERS.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR/CONSUMER"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "fcbb38d1-a750-4718-97d9-eebacbf71d20"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-SHOPPERS.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.PLR-SHOPPERS.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR/CONSUMER"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "cecd3d4b-f68e-4c4a-a9c4-5a2db9aef8ee"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "CONSUMER"
      + service_account_user_id = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*